jorgebucaran/fisher
jorgebucaran/nvm.fish
jorgebucaran/autopair.fish
deather/omf-sdk
oh-my-fish/plugin-foreign-env
jethrokuan/z
acomagu/fish-async-prompt
gazorby/fish-abbreviation-tips
patrickf1/fzf.fish
