tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Dev tools
cask "dash"
cask "docker"
cask "jetbrains-toolbox"
cask "postman"
cask "visual-studio-code"
cask "pbkit/tap/pbkit"
cask "clang-format"

# CLI & Terminal
cask "font-fira-code-nerd-font"
cask "iterm2"

# Window/screen management
cask "alt-tab"
cask "monitorcontrol"
cask "rectangle"

# Productivity etc.
cask "firefox"
cask "google-chrome"
cask "karabiner-elements"
cask "notion"
cask "numi"
cask "signal"
cask "spotify"

# Misc
cask "aldente"
cask "appcleaner"
cask "bartender"
cask "stats"
cask "menubarx"
