tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "coursier/formulas"
tap "virtuslab/scala-cli"

# Dotfiles management
brew "chezmoi"

# Dev tools
brew "git"
brew "gh"
brew "nvm"
brew "coursier/formulas/coursier"
brew "virtuslab/scala-cli/scala-cli"
brew "sdkman-cli"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "dash"
cask "postman"

# Utilities
cask "iterm2"
brew "fish"
brew "iperf3"
brew "fzf"
brwe "jq"

# Window management
cask "rectangle"
cask "alt-tab"

# Productivity etc.
cask "notion"
cask "google-chrome"
cask "firefox"
cask "signal"
cask "appcleaner"
cask "aldente"
